Repository: bikrant07/gyansetu
Catalog: gyansetu_mobileApp/lib/l10n/app_*.arb
Languages: hi

# questionSubmitted
source: Question submitted successfully
hi: प्रश्न सफलतापूर्वक जमा किया गया

source: Error submitting question
hi: प्रश्न जमा करने में त्रुटि

# askExpert
source: Ask an Expert
hi: विशेषज्ञ से पूछें

# enterYourQuestion
source: Enter your farming related question...
hi: अपना कृषि संबंधित प्रश्न दर्ज करें...

source: Submit
hi: जमा करें

# appTitle
source: GyanSetu
hi: ज्ञानसेतु

# welcomeMessage
source: Welcome to GyanSetu
hi: ज्ञानसेतु में आपका स्वागत है

source: Select Language
hi: भाषा चुनें

source: Profile
hi: प्रोफ़ाइल

source: Home
hi: होम

source: Ask AI
hi: AI से पूछें

source: Bio
hi: परिचय

source: Edit Bio
hi: परिचय संपादित करें

source: Change Profile Picture
hi: प्रोफ़ाइल फ़ोटो बदलें

source: Logout
hi: लॉग आउट

source: Learning Progress
hi: सीखने की प्रगति

# noQuizAttempts
source: No quiz attempts yet. Take some quizzes to see your progress!
hi: अभी तक कोई क्विज़ प्रयास नहीं। अपनी प्रगति देखने के लिए कुछ क्विज़ लें!

source: Today
hi: आज

source: Yesterday
hi: कल

source: Notifications
hi: सूचनाएं

source: Changing language...
hi: भाषा बदल रहा है...

# greeting
source: Hi, {profileName} !!
hi: नमस्ते, {profileName} !!

# motto
source: Education for Life, Education for Living
hi: जीवन के लिए शिक्षा, जीने के लिए शिक्षा

# krishiTitle
source: Krishi
hi: कृषि

source: Study Materials
hi: अध्ययन सामग्री

source: Materials
hi: सामग्री

source: Quizzes
hi: प्रश्नोत्तरी

source: Search users...
hi: उपयोगकर्ता खोजें...

source: No users available
hi: कोई उपयोगकर्ता उपलब्ध नहीं

source: Send message
hi: संदेश भेजें

# typeMessage
source: Type a message...
hi: संदेश टाइप करें...

source: Agriculture
hi: कृषि

# modernFarmingTitle
source: Modern Farming Techniques
hi: आधुनिक कृषि तकनीकें

# farmingSubtitle
source: Explore sustainable and profitable farming methods
hi: स्थायी और लाभदायक कृषि विधियों का अन्वेषण करें

source: Crop Selection
hi: फसल चयन

# cropSelectionDesc
source: Choose the right crops for your soil and climate
hi: अपनी मिट्टी और जलवायु के लिए सही फसलों का चयन करें

# cropContent1
source: Conduct soil testing to determine pH, nutrients, and texture
hi: मिट्टी की जांच करें (पीएच, पोषक तत्व, और बनावट)

# cropContent2
source: Consider local climate patterns and growing season length
hi: स्थानीय जलवायु पैटर्न और उगाने के मौसम पर विचार करें

# cropContent3
source: Research market demand and prices for different crops
hi: विभिन्न फसलों की बाजार मांग और कीमतों का अध्ययन करें

# cropContent4
source: Plan crop rotation to maintain soil health
hi: मिट्टी की सेहत के लिए फसल चक्र की योजना बनाएं

# cropContent5
source: Select disease-resistant varieties suitable for your region
hi: आपके क्षेत्र के लिए रोग-प्रतिरोधी किस्मों का चयन करें

# cropContent6
source: Consider water availability and irrigation requirements
hi: पानी की उपलब्धता और सिंचाई आवश्यकताओं पर विचार करें

# soilManagement
source: Management
hi: प्रबंधन

# soilManagementDesc
source: Maintain soil health for better yields
hi: बेहतर उपज के लिए मिट्टी की सेहत बनाए रखें

# soilContent1
source: Add organic matter through compost and green manure
hi: कम्पोस्ट और हरी खाद से जैविक पदार्थ जोड़ें

# soilContent2
source: Practice minimum tillage to preserve soil structure
hi: मिट्टी की संरचना के लिए न्यूनतम जुताई करें

# soilContent3
source: Maintain proper drainage to prevent waterlogging
hi: जलभराव रोकने के लिए उचित जल निकासी बनाएं

# soilContent4
source: Use cover crops to prevent soil erosion
hi: मिट्टी के कटाव को रोकने के लिए कवर फसलें लगाएं

# soilContent5
source: Apply balanced fertilizers based on soil test results
hi: मिट्टी परीक्षण के आधार पर संतुलित उर्वरक डालें

# soilContent6
source: Monitor soil moisture and adjust irrigation accordingly
hi: मिट्टी की नमी की निगरानी करें और सिंचाई समायोजित करें

source: Irrigation
hi: सिंचाई

# irrigationDesc
source: Modern irrigation techniques
hi: आधुनिक सिंचाई तकनीकें

# irrigationContent1
source: Install drip irrigation for water efficiency
hi: पानी की बचत के लिए ड्रिप सिंचाई लगाएं

# irrigationContent2
source: Use soil moisture sensors for precise irrigation
hi: सटीक सिंचाई के लिए मिट्टी की नमी सेंसर का उपयोग करें

# irrigationContent3
source: Schedule irrigation based on crop water requirements
hi: फसल की पानी की आवश्यकता के अनुसार सिंचाई करें

# irrigationContent4
source: Maintain proper water pH for nutrient absorption
hi: पोषक तत्वों के अवशोषण के लिए पानी का पीएच सही रखें

# irrigationContent5
source: Consider rainwater harvesting systems
hi: वर्षा जल संचयन प्रणाली पर विचार करें

# irrigationContent6
source: Implement mulching to reduce water evaporation
hi: पानी के वाष्पीकरण को कम करने के लिए मल्चिंग करें

# soilTypesTitle
source: Soil Types
hi: मिट्टी के प्रकार

source: Sandy Soil
hi: बलुई मिट्टी

# sandySoilCharacteristic1
source: Light and well-aerated
hi: हल्की और अच्छी वायुयुक्त

# sandySoilCharacteristic2
source: Warms up quickly in spring
hi: बसंत में जल्दी गर्म होती है

# sandySoilCharacteristic3
source: Drains water quickly
hi: जल को जल्दी निकालती है

# sandySoilCharacteristic4
source: Low in nutrients
hi: पोषक तत्वों में कम

# sandySoilCharacteristic5
source: Easy to work with
hi: आसानी से काम करने योग्य

# sandySoilBestCrop1
source: Carrots
hi: गाजर

# sandySoilBestCrop2
source: Potatoes
hi: आलू

# sandySoilBestCrop3
source: Radishes
hi: मूली

# sandySoilBestCrop4
source: Lettuce
hi: सलाद

# sandySoilBestCrop5
source: Strawberries
hi: स्ट्रॉबेरी

# sandySoilManagement1
source: Add organic matter regularly
hi: नियमित रूप से जैविक पदार्थ जोड़ें

# sandySoilManagement2
source: Use mulch to retain moisture
hi: नमी बनाए रखने के लिए मल्च का उपयोग करें

# sandySoilManagement3
source: Frequent but light watering
hi: बार-बार लेकिन हल्की सिंचाई करें

# sandySoilManagement4
source: Regular fertilization needed
hi: नियमित उर्वरक की आवश्यकता

source: Clay Soil
hi: चिकनी मिट्टी

# claySoilCharacteristic1
source: Heavy and dense
hi: भारी और घनी

# claySoilCharacteristic2
source: Retains water well
hi: जल को अच्छी तरह बनाए रखती है

# claySoilCharacteristic3
source: Rich in nutrients
hi: पोषक तत्वों से भरपूर

# claySoilCharacteristic4
source: Slow to warm in spring
hi: बसंत में गर्म होने में धीमी

# claySoilCharacteristic5
source: Can be difficult to work
hi: काम करने में कठिन हो सकती है

# claySoilBestCrop1
source: Wheat
hi: गेहूं

# claySoilBestCrop2
source: Rice
hi: धान

# claySoilBestCrop3
source: Cabbage
hi: गोभी

# claySoilBestCrop4
source: Broccoli
hi: ब्रोकली

# claySoilBestCrop5
source: Beans
hi: बीन्स

# claySoilManagement1
source: Avoid working when wet
hi: गीले होने पर काम करने से बचें

# claySoilManagement2
source: Add organic matter to improve structure
hi: संरचना में सुधार के लिए जैविक पदार्थ जोड़ें

# claySoilManagement3
source: Improve drainage if needed
hi: यदि आवश्यक हो तो जल निकासी में सुधार करें

# claySoilManagement4
source: Deep watering but less frequent
hi: गहरी सिंचाई करें लेकिन कम बार

# soilCharacteristics
source: Characteristics
hi: विशेषताएं

# soilBestCrops
source: Best Crops
hi: उपयुक्त फसलें

source: Fish Farming
hi: मत्स्य पालन

source: Pond Management
hi: तालाब प्रबंधन

# pondManagementDesc
source: Maintain optimal pond conditions
hi: तालाब की स्थिति को अनुकूल बनाए रखें

source: Species Selection
hi: प्रजाति चयन

source: Water Quality
hi: जल गुणवत्ता

source: Poultry Farming
hi: कुक्कुट पालन

source: Breed Selection
hi: नस्ल चयन

source: Housing
hi: आवास

source: Nutrition
hi: पोषण

# weatherImpactTitle
source: Weather Impact on Crops
hi: फसलों पर मौसम का प्रभाव

# temperatureImpactTitle
source: Temperature
hi: तापमान

# temperatureImpactDesc
source: Affects growth rate and development
hi: विकास दर और विकास को प्रभावित करता है

# rainfallImpactTitle
source: Rainfall
hi: वर्षा

# rainfallImpactDesc
source: Critical for germination and growth
hi: अंकुरण और विकास के लिए महत्वपूर्ण

# windImpactTitle
source: Wind
hi: हवा

# windImpactDesc
source: Influences pollination and plant structure
hi: परागण और पौधे की संरचना को प्रभावित करती है

# sunlightImpactTitle
source: Sunlight
hi: सूर्य प्रकाश

# sunlightImpactDesc
source: Essential for photosynthesis
hi: प्रकाश संश्लेषण के लिए आवश्यक

source: Wheat Crop Cycle
hi: गेहूं का फसल चक्र

source: Rice Crop Cycle
hi: धान का फसल चक्र

# cropDuration
source: Duration
hi: अवधि

# wheatStage1
source: Seed Germination: Seeds absorb water and begin to sprout, developing initial root and shoot
hi: बीज अंकुरण: बीज पानी अवशोषित करते हैं और अंकुरित होना शुरू करते हैं, प्रारंभिक जड़ और अंकुर विकसित करते हैं

# wheatStage2
source: Seedling Growth: First leaves emerge and plant establishes itself in soil
hi: पौध विकास: पहली पत्तियां निकलती हैं और पौधा मिट्टी में स्थापित होता है

# wheatStage3
source: Tillering Phase: Multiple stems develop from the base of the plant
hi: कल्ले निकलने का चरण: पौधे के आधार से कई तने विकसित होते हैं

# wheatStage4
source: Stem Extension: Plant grows taller and develops more leaves
hi: तना विकास: पौधा लंबा होता है और अधिक पत्तियां विकसित करता है

# wheatStage5
source: Heading Stage: Grain head emerges from the stem's flag leaf
hi: बाली निकलने का चरण: तने की ध्वज पत्ती से अनाज की बाली निकलती है

# wheatStage6
source: Flowering Phase: Pollination occurs and kernels begin to form
hi: फूल आने का चरण: परागण होता है और दाने बनना शुरू होते हैं

# wheatStage7
source: Grain Filling: Kernels develop and fill with starch
hi: दाना भरने का चरण: दाने विकसित होते हैं और स्टार्च से भरते हैं

# wheatStage8
source: Ripening: Grain matures and dries, plant turns golden-brown
hi: पकने का चरण: अनाज परिपक्व होता है और सूखता है, पौधा सुनहरा-भूरा हो जाता है

# riceStage1
source: Seed Selection: Choose high-quality seeds and prepare them for sowing
hi: बीज चयन: उच्च गुणवत्ता वाले बीजों का चयन करें और बुवाई के लिए तैयार करें

# riceStage2
source: Nursery Preparation: Seeds are sown in nursery beds for initial growth
hi: नर्सरी तैयारी: बीजों को नर्सरी बेड में प्रारंभिक विकास के लिए बोया जाता है

# riceStage3
source: Transplanting: Young seedlings are moved to the main field
hi: रोपाई: युवा पौधों को मुख्य खेत में स्थानांतरित किया जाता है

# riceStage4
source: Vegetative Phase: Plant develops tillers and grows in height
hi: वानस्पतिक चरण: पौधा कल्ले निकालता है और ऊंचाई में बढ़ता है

# riceStage5
source: Reproductive Stage: Panicle develops and flowering occurs
hi: प्रजनन चरण: बाली विकसित होती है और फूल आते हैं

# riceStage6
source: Ripening Phase: Grain fills and matures, changing from green to golden
hi: पकने का चरण: दाना भरता है और पकता है, हरे से सुनहरा होता है

# riceStage7
source: Harvesting: Crop is harvested when grains are mature and golden
hi: कटाई: फसल की कटाई तब की जाती है जब दाने पक जाते हैं और सुनहरे हो जाते हैं

# wheatDuration
source: 120-150 days
hi: 120-150 दिन

# riceDuration
source: 100-150 days
hi: 100-150 दिन

source: Characteristics
hi: विशेषताएं

source: Best Crops
hi: उपयुक्त फसलें

source: Management Tips
hi: प्रबंधन सुझाव
